## Read in the launches CSV file from TidyTuesday

In [1]:
import pandas as pd

In [2]:
data_url = 'https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2019/2019-01-15/launches.csv'

In [3]:
df = pd.read_csv( data_url )

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5726 entries, 0 to 5725
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   tag          5726 non-null   object
 1   JD           5726 non-null   float64
 2   launch_date  5713 non-null   object
 3   launch_year  5726 non-null   int64
 4   type         5726 non-null   object
 5   variant      745 non-null    object
 6   mission      5705 non-null   object
 7   agency       3282 non-null   object
 8   state_code   5726 non-null   object
 9   category     5726 non-null   object
 10  agency_type  5726 non-null   object
dtypes: float64(1), int64(1), object(9)
memory usage: 492.2+ KB

In [5]:
df.isna().sum()

tag               0
JD                0
launch_date      13
launch_year       0
type              0
variant        4981
mission          21
agency         2444
state_code        0
category          0
agency_type       0
dtype: int64

In [6]:
df.nunique()

tag            5726
JD             5720
launch_date    5048
launch_year      62
type            366
variant          72
mission        4244
agency           40
state_code       17
category          2
agency_type       3
dtype: int64

In [7]:
df.category.value_counts()

O    5384
F     342
Name: category, dtype: int64

In [8]:
df.JD.value_counts()

2441076.82    2
2443403.10    2
2440933.04    2
2437165.33    2
2441550.94    2
             ..
2446411.11    1
2445908.87    1
2445220.93    1
2446729.15    1
2445448.10    1
Name: JD, Length: 5720, dtype: int64

In [9]:
df.head()

,tag,JD,launch_date,launch_year,type,variant,mission,agency,state_code,category,agency_type
0,1967-065,2439671.38,1967-06-29,1967,Thor Burner 2,NaN,Secor Type II S/N 10,US,US,O,state
1,1967-080,2439725.70,1967-08-23,1967,Thor Burner 2,NaN,DAPP 3419,US,US,O,state
2,1967-096,2439774.83,1967-10-11,1967,Thor Burner 2,NaN,DAPP 4417,US,US,O,state
3,1968-042,2439999.69,1968-05-23,1968,Thor Burner 2,NaN,DAPP 5420,US,US,O,state
4,1968-092,2440152.69,1968-10-23,1968,Thor Burner 2,NaN,DAPP 6422,US,US,O,state

In [10]:
df.launch_year.value_counts()

1967    139
1971    134
1975    132
1966    131
1976    131
       ...
1961     50
1960     37
1958     27
1959     22
1957      3
Name: launch_year, Length: 62, dtype: int64

In [11]:
df.groupby(['type']).size().reset_index(name='num_rows')

                 type  num_rows
0         ARPA Taurus         2
1                ASLV         4
2           Angara A5         1
3         Antares 110         2
4         Antares 120         2
..                ...       ...
361  Zenit-2 11K77.05         1
362          Zenit-2M         1
363         Zenit-2SB         1
364         Zenit-3SL        36
365        Zenit-3SLB         4

[366 rows x 2 columns]

In [12]:
df.agency.value_counts()

US        1202
RU         619
CN         302
AE         260
ILSK        97
J           78
ULAL        71
SPX         68
IN          65
MDSSC       62
OSC         60
ULAB        60
BLS         56
LMA         43
MHI         34
ILSL        31
SEALP       26
STSM        20
GDCLS       14
EUROK       14
I-ESA       13
F           11
IL          10
I            9
IR           8
MMCLS        7
ELUS         6
KP           5
MMA          4
PU           4
SEALC        4
RSC          3
KR           3
I-ELDO       3
OATK         2
UK           2
RLABU        2
BR           2
EER          1
LMSC         1
Name: agency, dtype: int64